{"node-mvc-framework":{"title":"Oops, I made another Node MVC Framework","body":"&lt;p&gt;So, the last thing you want to do right now is look at another MVC framework. I get that. Don&amp;#39;t worry, I&amp;#39;m not trying to get you to use it, or even look at it. I just want to tell you a bit about the process of building it, because I learned a lot, and came up with some patterns that other developers might find interesting.&lt;/p&gt;\r\n&lt;p&gt;I learn by doing. I find it to be faster, more enjoyable, more effective, and better preparation for paid work in the real world. So when I was thinking about making a new website where I could write about my projects, it seemed like a great opportunity to get more experience with Node. And if I wanted to get more experience with server-side JavaScript, I wouldn&amp;#39;t be doing myself much of a favor if I just used Express, hooked up some middleware, and slapped Node on my resume. So I set out to make a full-fledged framework using vanilla Node with all the features I could think of. Authentication and session mangement, CSRF &amp;amp; brute force protection, a full template engine, a data access layer, the works. Some other really neat stuff came out of it, too, like a handly error-handling module and a custom promise implementation that I&amp;#39;m excited to tell you about.&lt;/p&gt;\r\n&lt;p&gt;The goal initially was to use zero dependencies, but I ended up using two. Turns out that Node doesn&amp;#39;t parse request body data for you, it just gives you a buffer stream. Writing a parser for that myself would have taken God knows how long, so I caved and used &lt;a href=&quot;https://github.com/felixge/node-formidable&quot;&gt;Formidable&lt;/a&gt;. The second dependency I grabbed was bCrypt, because, let&amp;#39;s be honest, when it comes to security we don&amp;#39;t want to mess around. I&amp;#39;m already pushing it by writing my own CSRF protection and session expiration and all.&lt;/p&gt;\r\n&lt;p&gt;So, it&amp;#39;s taken me a whole summer (and a bit into the fall), only being able to work for a half hour here and there, but it&amp;#39;s finally gotten to a point where the P1 features are all there and I&amp;#39;ve been able to actually build this site on it. I&amp;#39;m not ready to publish it to npm, and am turning my priorities to publishing a number of smaller packages and launching this site. But over the next few months I plan to write up posts on all the various modules and patterns I used to put this framework together.&lt;/p&gt;\r\n&lt;p&gt;I call it Breadbox, by the way. So don&amp;#39;t go taking that name before I publish it on npm.&lt;/p&gt;\r\n","date":"Fri Oct 23 2015"}}