{"node-mvc-framework":{"title":"Oops, I made another Node MVC Framework","body":"<p>So, the last thing you want to do right now is look at another JS framework. I get that. Don&#39;t worry, I&#39;m not going to try and convince you to use it. In fact I would predict that as the language and browsers evolve we&#39;re going to move away from frameworks altogether, but that&#39;s a different topic. For now I just want to share a bit about what I intend to do with this blog.</p>\r\n<p>I learn by doing. I find it to be faster, more enjoyable, more effective, and better preparation for paid work in the real world. So when I was thinking about making a new website where I could write about my projects, it seemed like a great opportunity to get more experience with Node. And if I wanted to get more experience with server-side JavaScript, I wouldn&#39;t be doing myself much of a favor if I just used Express, hooked up some middleware, and slapped Node on my resume. So I set out to make a full-fledged framework using vanilla Node with all the features I might desire for the development of a blog-ish website. Authentication and session mangement, CSRF &amp; brute force protection, a nice template engine, a data access layer, error handling, cookies, routing, the works. Some pretty neat stuff came out of it, too, like an enhanced promise implementation that I&#39;ll write about later.</p>\r\n<p>The goal initially was to use zero dependencies, but I ended up using two. Turns out that Node doesn&#39;t parse request body data for you, it just gives you a buffer stream. Writing a parser for that myself would have taken God knows how long, so I caved and used <a href=&quot;https://github.com/felixge/node-formidable&quot;>Formidable</a>. The second dependency I grabbed was bCrypt, because, let&#39;s be honest, when it comes to security we don&#39;t want to mess around. I&#39;m already pushing it by writing my own CSRF protection and session management and all.</p>\r\n<p>So, it&#39;s taken me a whole summer (and a bit into the fall), only being able to work for a half hour here and there, but it&#39;s finally gotten to a point where the P1 features are all there and I&#39;ve been able to actually build this site on it. I&#39;m still not ready to call it a V1, and to be honest there&#39;s a good chance I never will. There&#39;s a lot of really exciting stuff going on in JS-land these days and I&#39;m more excited about building products than modules. But at the least I&#39;d like to write up some posts on the bits and peices I learned from this, and I&#39;ll probably package up and publish a few peices, like the template engine.</p>\r\n<p>I call it Breadbox, by the way. So don&#39;t go taking that name.</p>\r\n","date":"Thu Oct 1 2015","live":"on"}}